package com.cheng.滑动窗口;

/**
 * 1004. 最大连续1的个数 III
 *
 * 给定一个由若干 0 和 1 组成的数组 A，我们最多可以将 K 个值从 0 变成 1 。
 *
 * 返回仅包含 1 的最长（连续）子数组的长度。
 *
 *  
 *
 * 示例 1：
 *
 * 输入：A = [1,1,1,0,0,0,1,1,1,1,0], K = 2
 * 输出：6
 * 解释：
 * [1,1,1,0,0,1,1,1,1,1,1]
 * 粗体数字从 0 翻转到 1，最长的子数组长度为 6。
 * 示例 2：
 *
 * 输入：A = [0,0,1,1,0,0,1,1,1,0,1,1,0,0,0,1,1,1,1], K = 3
 * 输出：10
 * 解释：
 * [0,0,1,1,1,1,1,1,1,1,1,1,0,0,0,1,1,1,1]
 * 粗体数字从 0 翻转到 1，最长的子数组长度为 10。

 * @author nuonuo
 * @create 2021-10-01 13:36
 */
public class 最大连续1的个数III {
    public int longestOnes(int[] nums, int k) {
        int l = 0, r = 0;
        int zoro = 0;
        while (r < nums.length) {
            if (nums[r] == 0) {
                zoro++;
            }
            if (zoro > k) {
                if (nums[l++] == 0) {
                    zoro--;
                }
            }
            r++;
        }
        return r - l;
    }
}
